IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280013x_adc_regs.xml
	<register id="ADCSOC1CTL" width="32" page="1" offset="0x12" internal="0" description="ADC SOC1 Control Register">
		<bitfield id="ACQPS" description="SOC1 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC1 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC1 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC2CTL" width="32" page="1" offset="0x14" internal="0" description="ADC SOC2 Control Register">
		<bitfield id="ACQPS" description="SOC2 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC2 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC2 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC3CTL" width="32" page="1" offset="0x16" internal="0" description="ADC SOC3 Control Register">
		<bitfield id="ACQPS" description="SOC3 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC3 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC3 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC4CTL" width="32" page="1" offset="0x18" internal="0" description="ADC SOC4 Control Register">
		<bitfield id="ACQPS" description="SOC4 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC4 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC4 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC5CTL" width="32" page="1" offset="0x1a" internal="0" description="ADC SOC5 Control Register">
		<bitfield id="ACQPS" description="SOC5 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC5 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC5 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC6CTL" width="32" page="1" offset="0x1c" internal="0" description="ADC SOC6 Control Register">
		<bitfield id="ACQPS" description="SOC6 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC6 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC6 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC7CTL" width="32" page="1" offset="0x1e" internal="0" description="ADC SOC7 Control Register">
		<bitfield id="ACQPS" description="SOC7 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC7 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC7 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC8CTL" width="32" page="1" offset="0x20" internal="0" description="ADC SOC8 Control Register">
		<bitfield id="ACQPS" description="SOC8 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC8 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC8 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC9CTL" width="32" page="1" offset="0x22" internal="0" description="ADC SOC9 Control Register">
		<bitfield id="ACQPS" description="SOC9 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC9 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC9 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC10CTL" width="32" page="1" offset="0x24" internal="0" description="ADC SOC10 Control Register">
		<bitfield id="ACQPS" description="SOC10 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC10 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC10 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC11CTL" width="32" page="1" offset="0x26" internal="0" description="ADC SOC11 Control Register">
		<bitfield id="ACQPS" description="SOC11 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC11 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC11 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC12CTL" width="32" page="1" offset="0x28" internal="0" description="ADC SOC12 Control Register">
		<bitfield id="ACQPS" description="SOC12 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC12 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC12 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC13CTL" width="32" page="1" offset="0x2a" internal="0" description="ADC SOC13 Control Register">
		<bitfield id="ACQPS" description="SOC13 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC13 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC13 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
	<register id="ADCSOC14CTL" width="32" page="1" offset="0x2c" internal="0" description="ADC SOC14 Control Register">
		<bitfield id="ACQPS" description="SOC14 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC14 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC14 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
	</register>
